import random
answers = ['Бесспорно', 'Предрешено', 'Никаких сомнений', 'Определённо да', 'Можешь быть уверен в этом',
           'Мне кажется - да', 'Вероятнее всего', 'Хорошие перспективы', 'Знаки говорят - да', 'Да',
           'Пока неясно, попробуй снова', 'Спроси позже', 'Лучше не рассказывать', 'Сейчас нельзя предсказать',
           'Сконцентрируйся и спроси опять', 'Даже не думай', 'Мой ответ - нет', 'По моим данным - нет',
           'Перспективы не очень хорошие', 'Весьма сомнительно']

print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.\n')
name = input('Представьтесь пожалуйста: \n')
print('Привет,', name)

def questionss():
    while True:
        question = input('На какой вопрос мне дать вам ответ?\n')
        print(random.choice(answers))
        print('Ещё один вопрос? (д/н)')
        if input().lower() not in ('y', 'yes', 'д', 'да'):
            print('Возвращайся если возникнут вопросы!')
            return

questionss()